# Быстрые действия

# R1 (if EcoRouter):
-----Internet-----

    ecorouter>enable
    ecorouter#configure terminal 
    Enter configuration commands, one per line.  End with CNTL/Z.
    ecorouter(config)#hostname R1
    R1(config)#ip domain-name ?au-team.irpo? (+/-)
    R1(config)#write memory
    Building configuration...
    R1(config)#

    Провекрка ^^ (R1#show hostname) ^^

    interface Internet
    description "Internet"
    ip address ?172.16.4.2/28?
    R1(config)#ip route 0.0.0.0/0 ?172.16.4.1? (+/-)
  
    Провекрка ^^ (R1#show port brief) ^^

    R1(config)#port te0
    R1(config-port)#service-instance te0/Internet
    R1(config-service-instance)#encapsulation untagged 
    R1(config-service-instance)#connect ip interface Internet
    2025-05-02 07:39:50      INFO      Interface Internet changed state to up
    R1(config-service-instance)#exit
    R1(config-port)#exit
    R1(config)#write memory
    Building configuration...
    R1(config)#

    Провекрка ^^ (R1#show ip interface brief, R1#show ip route static) ^^
  -----Admin, Cli (R1 if EcoRouter)-----
  
    R1(config)#interface ?l100? (+/-)
    R1(config-if)#description "Admins - vlan100"
    R1(config-if)#ip address 192.168.101.1/24
    R1(config-if)#exit
    R1(config)#
    R1(config)#interface vl200
    R1(config-if)#description "Clients - vlan200"
    R1(config-if)#ip address 192.168.101.10/24
    R1(config-if)#exit
    R1(config)#

    R1(config)#port te1
    R1(config-port)#service-instance te1/vl100
    R1(config-service-instance)#encapsulation dot1q 100 exact 
    R1(config-service-instance)#rewrite pop 1
    R1(config-service-instance)#connect ip interface vl100
    hq-rtr(config-service-instance)#exit
    
    R1(config)#port te1
    R1(config-port)#service-instance te1/vl200
    R1(config-service-instance)#encapsulation dot1q 200 exact 
    R1(config-service-instance)#rewrite pop 1
    R1(config-service-instance)#connect ip interface vl200
    R1(config-port)#exit
    R1(config)#write memory
    Building configuration...
    R1(config)#
    
    Провекрка ^^ (R1#show ip interface brief ) ^^
  -----Cam1, R2(R1 if EcoRouter)-----
  
    R1(config)#interface Cam1 (Cams)
    R1(config-if)#description "Cam1 - Cams"
    R1(config-if)#ip address 192.168.120.1/24  

    (50/50)
    R1(config)#interface Router2 (R2)
    R1(config-if)#description "Router2 - R2"
    R1(config-if)#ip address 10.10.10.10.0/30
    
    Провекрка ^^ (R1#show port brief) ^^
    
    R1(config)#port te2
    R1(config-port)#service-instance te2/Cam1
    R1(config-service-instance)# ?encapsulation dot1q 100 exact? 
    R1(config-service-instance)# ?rewrite pop 1?
    R1(config-service-instance)#connect ip interface Cam1
    hq-rtr(config-service-instance)#exit

    (50/50)
    R1(config)#port te3
    R1(config-port)#service-instance te3/Router2
    R1(config-service-instance)# ?encapsulation dot1q 200 exact? 
    R1(config-service-instance)# ?rewrite pop 1?
    R1(config-service-instance)#connect ip interface Router2
    R1(config-port)#exit
    R1(config)#write memory
    Building configuration...
    R1(config)#

    Провекрка ^^ (R1#show ip interface brief ) ^^
