# Быстрые действия

# R1 (if EcoRouter):
-----Имена-----

    ecorouter>enable
    ecorouter#configure terminal 
    Enter configuration commands, one per line.  End with CNTL/Z.
    ecorouter(config)#hostname R1
    R1(config)#ip domain-name ?au-team.irpo? (+/-)
    R1(config)#write memory
    Building configuration...
    R1(config)#

    ^^ Провекрка ^^ 
    |R1#show hostname,
    |R1#show running-config | include domain-name
-----Internet-----

    interface Internet
    description "Internet"
    ip address ?172.16.4.2/28?
    R1(config)#ip route 0.0.0.0/0 ?172.16.4.1? (+/-)
  
    ^^ Провекрка ^^
    |R1#show port brief

    R1(config)#port te0
    R1(config-port)#service-instance te0/Internet
    R1(config-service-instance)#encapsulation untagged 
    R1(config-service-instance)#connect ip interface Internet
    2025-05-02 07:39:50      INFO      Interface Internet changed state to up
    R1(config-service-instance)#exit
    R1(config-port)#exit
    R1(config)#write memory
    Building configuration...
    R1(config)#

    ^^ Провекрка ^^ 
    |R1#show ip interface brief,
    |R1#show ip route static
  -----Admin, Cli (R1 if EcoRouter)-----
  
    R1(config)#interface ?vl100? (+/-)
    R1(config-if)#description "Admins - vlan100"
    R1(config-if)#ip address 192.168.101.10/24
    R1(config-if)#exit
    R1(config)#
    R1(config)#interface vl200
    R1(config-if)#description "Clients - vlan200"
    R1(config-if)#ip address 192.168.101.11/24
    R1(config-if)#exit
    R1(config)#

    R1(config)#port te1
    R1(config-port)#service-instance te1/vl100
    R1(config-service-instance)#encapsulation dot1q 100 exact 
    R1(config-service-instance)#rewrite pop 1
    R1(config-service-instance)#connect ip interface vl100
    R1(config-service-instance)#exit
    
    R1(config)#port te1
    R1(config-port)#service-instance te1/vl200
    R1(config-service-instance)#encapsulation dot1q 200 exact 
    R1(config-service-instance)#rewrite pop 1
    R1(config-service-instance)#connect ip interface vl200
    R1(config-port)#exit
    R1(config)#write memory
    Building configuration...
    R1(config)#
    
    ^^ Провекрка ^^
    |R1#show ip interface brief
  -----Cam1, R2 (R1 if EcoRouter)-----
  
    R1(config)#interface Cam1 (Cams)
    R1(config-if)#description "Cam1 - Cams"
    R1(config-if)#ip address 192.168.120.1/24  

    (50/50)
    R1(config)#interface Router2 (R2)
    R1(config-if)#description "Router2 - R2"
    R1(config-if)#ip address 10.10.10.10.0/30
    
    ^^ Провекрка ^^
    |R1#show port brief
    
    R1(config)#port te2
    R1(config-port)#service-instance te2/Cam1
    R1(config-service-instance)# ?encapsulation dot1q 100 exact? 
    R1(config-service-instance)# ?rewrite pop 1?
    R1(config-service-instance)#connect ip interface Cam1
    R1(config-service-instance)#exit

    (50/50)
    R1(config)#port te3
    R1(config-port)#service-instance te3/Router2
    R1(config-service-instance)# ?encapsulation dot1q 200 exact? 
    R1(config-service-instance)# ?rewrite pop 1?
    R1(config-service-instance)#connect ip interface Router2
    R1(config-port)#exit
    R1(config)#write memory
    Building configuration...
    R1(config)#

    ^^ Провекрка ^^
    |R1#show ip interface brief
  -----R2 tunel (R1 if EcoRouter)-----
  
    R1>enable
    R1#configure terminal
    Enter configuration commands, one per line.  End with CNTL/Z.
    R1(config)#interface tunnel.0
    R1(config-if-tunnel)#description "R1-to-R2"
    R1(config-if-tunnel)#ip address 10.10.10.1/30
    R1(config-if-tunnel)#ip tunnel ?10.10.10.1? ?10.10.10.2? mode gre
    2025-05-03 07:58:58      INFO      Interface tunnel.0 changed state to up
    R1(config-if-tunnel)#end
    R1#write memory
    Building configuration...
    R1#

    R2>enable
    R2#configure terminal
    Enter configuration commands, one per line.  End with CNTL/Z.
    R2(config)#interface tunnel.0
    R2(config-if-tunnel)#description "R2-to-R1"
    R2(config-if-tunnel)#ip address 10.10.10.2/30
    R2(config-if-tunnel)#ip tunnel ?10.10.10.2? ?10.10.10.1? mode gre
    2025-05-03 07:58:58      INFO      Interface tunnel.0 changed state to up
    R2(config-if-tunnel)#end
    R2#write memory
    Building configuration...
    R2#
        
    ^^ Провекрка ^^
    |R1,2#show ip interface brief,
    |R1,2#show interface tunnel.0 show ip interface brief | include tunnel, 
    |R1,2#ping 10.10.10.1
-----OSPFv2, NAT?, DHCP, ?DNS? (R1,2 if EcoRouter)-----

OSPFv2

    R1#configure terminal 
    Enter configuration commands, one per line.  End with CNTL/Z.
    R1(config)#router ospf 1
    R1(config-router)#ospf router-id 10.10.10.1
    R1(config-router)#passive-interface default 
    R1(config-router)#no passive-interface tunnel.0 
    R1(config-router)#network 10.10.10.0/30 area 0
    R1(config-router)#network 192.168.101.10/24 area 0
    R1(config-router)#network 192.168.101.11/24 area 0
    R1(config-router)#network 192.168.120.0/24 area 0
    R1(config-router)#exit
    R1(config)#interface tunnel.0
    R1(config-if-tunnel)#ip ospf authentication message-digest 
    R1(config-if-tunnel)#ip ospf message-digest-key 1 md5 P@ssw0rd
    R1(config-if-tunnel)#exit
    R1(config)#write memory
    Building configuration...

    ^^ Провекрка ^^
    |R1,2#show ip ospf neighbor 
    |R1,2#show ip route ospf
    |R1,2#show ip opsf interface tunnel.0 
    |Admin#ip -br a
    |Admin#ping 192.168.120.25, 192.168.110.25, 192.168.102.10
----------------------------------------------------------------= new 29.05.25 =-----------------------------------------------------------------

NAT?

    R1>enable
    R1#configure terminal
    Enter configuration commands, one per line.  End with CNTL/Z.
    R1(config)#interface Internet 
    R1(config-if)#ip nat outside 
    R1(config-if)#exit
    R1(config)#
    R1(config)#interface vl100
    R1(config-if)#ip nat inside 
    R1(config-if)#exit
    R1(config)#interface vl200
    R1(config-if)#ip nat inside 
    R1(config-if)#exit
    R1(config)#
    R1(config)#ip nat pool HQ 192.168.101.1-192.168.101.254
    R1(config)#ip nat source dynamic inside-to-outside pool HQ overload interface Internet 
    R1(config)#write memory
    Building configuration...
    R1(config)#

    ^^ Провекрка ^^
    |Admin#ip ping 77.88.8.8
    |R1#show ip nat translation 
    
DHCP, ?DNS?

    R1(config)#
    R1>enable
    R1#configure terminal 
    Enter configuration commands, one per line.  End with CNTL/Z.
    R1(config)#ip pool Cli 192.168.10.11-192.168.101.253
    R1(config)#
    R1(config-dhcp-server)#pool Cli 1
    R1(config-dhcp-server-pool)#
    R1(config-dhcp-server-pool)#mask 24
    R1(config-dhcp-server-pool)#gateway 192.168.101.254
    R1(config-dhcp-server-pool)#dns ?192.168.101.2?
    R1(config-dhcp-server-pool)# ?domain-name au-team.irpo?
    R1(config-dhcp-server-pool)#exit
    R1(config-dhcp-server)#exit
    R1(config)#

    R1(config)#interface vl200 
    R1(config-if)#dhcp-server 1
    R1(config-if)#exit
    R1(config)#write memory
    Building configuration...
    R1(config)#

    ^^ Провекрка ^^
    |Client#ip -c a show ens??
    |Client#ip -c r
    |Client#ip ping 77.88.8.8
    |R1#show dhcp-server clients vl200

    R1#configure terminal 
    Enter configuration commands, one per line.  End with CNTL/Z.
    R1(config)#ip pool Internet?192.168.10.11-192.168.101.253?
    R1(config)#
    R1(config-dhcp-server)#pool Internet 1
    R1(config-dhcp-server-pool)#
    R1(config-dhcp-server-pool)#mask 24
    R1(config-dhcp-server-pool)#gateway?192.168.101.254?
    R1(config-dhcp-server-pool)#dns ?192.168.101.2?
    R1(config-dhcp-server-pool)# ?domain-name au-team.irpo?
    R1(config-dhcp-server-pool)#exit
    R1(config-dhcp-server)#exit
    R1(config)#

    R1(config)#interface Internet 
    R1(config-if)#dhcp-server 1
    R1(config-if)#exit
    R1(config)#write memory
    Building configuration...
    R1(config)#

-----#R2 (if EcoRouter)-----

-----Имена-----

    ecorouter>enable
    ecorouter#configure terminal 
    Enter configuration commands, one per line.  End with CNTL/Z.
    ecorouter(config)#hostname R2
    R2(config)#ip domain-name ?au-team.irpo? (+/-)
    R2(config)#write memory
    Building configuration...
    R1(config)#

    ^^ Провекрка ^^ 
    |R2#show hostname,
    |R2#show running-config | include domain-name

------Сеть------    
------R1 (R1 if EcoRouter)------

    (50/50)
    R1(config)#interface R1
    R2(config-if)#description "Connect R1"
    R2(config-if)#ip address 10.10.10.1/30
    
    R2(config)#port te0
    R2(config-port)#service-instance te0/R1
    R2(config-service-instance)# ?encapsulation dot1q 100 exact? 
    R2(config-service-instance)# ?rewrite pop 1?
    R2(config-service-instance)#connect ip interface R1
    
-------Printer (R1 if EcoRouter)------

    R2(config)#interface Printer
    R2(config-if)#description "Connect Printer"
    R2(config-if)#ip address 192.168.102.1/24  

    R2(config)#port te1
    R2(config-port)#service-instance te1/Printer
    R2(config-service-instance)# ?encapsulation dot1q 100 exact? 
    R2(config-service-instance)# ?rewrite pop 1?
    R2(config-service-instance)#connect ip interface Printer
    
 --------Cam2 (R1 if EcoRouter)-------
 
    R2(config)#interface Cam2 (Cams)
    R2(config-if)#description "Cam2 - Cams"
    R2(config-if)#ip address 192.168.110.1/24  

    R2(config)#port te2
    R2(config-port)#service-instance te2/Cam2
    R2(config-service-instance)# ?encapsulation dot1q 100 exact? 
    R2(config-service-instance)# ?rewrite pop 1?
    R2(config-service-instance)#connect ip interface Cam2
    R2(config-service-instance)#exit
    
-----OSPFv2, NAT?, DHCP, ?DNS? (R1,2 if EcoRouter)-----
OSPFv2

    R2#configure terminal 
    Enter configuration commands, one per line.  End with CNTL/Z.
    R2(config)#router ospf 1
    R2(config-router)#ospf router-id 10.10.10.1
    R2(config-router)#passive-interface default 
    R2(config-router)#no passive-interface tunnel.0 
    R2(config-router)#network 10.10.10.0/30 area 0
    R2(config-router)#network 192.168.102.0/24 area 0
    R2(config-router)#network 192.168.110.0/24 area 0
    R2(config-router)#exit
    R2(config)#interface tunnel.0
    R2(config-if-tunnel)#ip ospf authentication message-digest 
    R2(config-if-tunnel)#ip ospf message-digest-key 1 md5 P@ssw0rd
    R2(config-if-tunnel)#exit
    R2(config)#write memory
    Building configuration...

    ^^ Провекрка ^^
    |R1,2#show ip ospf neighbor 
    |R1,2#show ip route ospf
    |R1,2#show ip opsf interface tunnel.0 
    |Admin#ip -br a
    |Admin#ping 192.168.120.25, 192.168.110.25, 192.168.102.10

NAT?

    R2>enable
    R2#configure terminal
    Enter configuration commands, one per line.  End with CNTL/Z.
    R2(config)#interface R1
    R2(config-if)#ip nat outside 
    R2(config-if)#exit
    R2(config)#
    R2(config)#interface Cam2
    R2(config-if)#ip nat inside 
    R2(config-if)#exit
    R2(config)#interface Printer
    R2(config-if)#ip nat inside 
    R2(config-if)#exit
    R2(config)#
    R2(config)#ip nat pool HQ 10.10.10.1/10.10.10.2
    R2(config)#ip nat source dynamic inside-to-outside pool HQ overload interface R1 
    R2(config)#write memory
    Building configuration...
    R2(config)#

    ^^ Провекрка ^^
    |Admin#ip ping 77.88.8.8 (-)
    |R2#show ip nat translation 

-----ВЕЗДЕ-----

Время(EcoRuter,ALT Linux)

    R2>enable
    R2#ntp timezone utc+? (время в регионе)
    R2#write memory
    
    Admin,Cli# timedatectl set-timezone Регион/Страна (или панель упрваления)

Пользователи(EcoRuter,ALT Linux)

    R1,2>enable
    R1,2#configure terminal 
    Enter configuration commands, one per line.  End with CNTL/Z.
    R1,2(config)#username net_admin (Пример)
    R1,2(config-user)#password P@$$word
    R1,2(config-user)#role admin 
    R1,2(config-user)#exit
    R1,2(config)#write memory
    Building configuration...

    Admin,Cli#useradd sshuser –u 1010
    Admin,Cli#passwd sshuer
    Admin,Cli#usermod -aG wheel sshuser
    Admin,Cli#echo "sshuser ALL=(ALL:ALL) NOPASSWD: ALL" >> /etc/sudoers
    
    или
    
![изображение](https://github.com/user-attachments/assets/280b69ef-4174-4199-b974-21815aca3330)
![изображение](https://github.com/user-attachments/assets/97383198-7464-4637-a7ee-7076389a2d66)
![изображение](https://github.com/user-attachments/assets/99e6a841-d1a7-4b57-9da5-44c176210ced)

# (30.05.25 mini fix Eco +mini Alt Linux)

#R1 (Alt Linux)
-----Имена-----

    hostnamectl set-hostname R1?.au-team.irpo?; exec bash
        ^^ Провекрка ^^
    hostname -f
-----Internet-----

    ip link
    apt-get update && apt-get install -y openvswitch
    ip -c a
    mkdir /etc/net/ifaces/ens?? (Internet)
    cat <<EOF > /etc/net/ifaces/ens?? (Internet)
      TYPE=eth
      DISABLED=no
      NM_CONTROLLED=no
      BOOTPROTO=dhcp
    EOF
-----Admin, Cli (R1 if Alt Linux)-----

    Admin
    mkdir /etc/net/ifaces/vlan100
    cat <<EOF > /etc/net/ifaces/vlan100/options
      TYPE=ovsport
      BRIDGE=R1-SW
      VID=100
      BOOTPROTO=static
      CONFIG_IPV4=yes
    EOF
    echo "192.168.101.10/24" > /etc/net/ifaces/vlan100/ipv4address

    Client
    mkdir /etc/net/ifaces/vlan200
    cat <<EOF > /etc/net/ifaces/vlan200/options
      TYPE=ovsport
      BRIDGE=R1-SW
      VID=200
      BOOTPROTO=dhcp
      CONFIG_IPV4=yes
    EOF

    Cams1
    mkdir /etc/net/ifaces/Cam1
    cat <<EOF > /etc/net/ifaces/Cam1/options
     TYPE=eth
     CONFIG_WIRELESS=no
     BOOTPROTO=static
     CONFIG_IPV4=yes
    EOF
    echo "192.168.120.1/24" > /etc/net/ifaces/Cam1/ipv4address
    
    R2 (50/50)
    mkdir /etc/net/ifaces/R2
    cat <<EOF > /etc/net/ifaces/Cam1/options
     TYPE=eth
     CONFIG_WIRELESS=no
     BOOTPROTO=static
     CONFIG_IPV4=yes
    EOF
    echo "10.10.10.1/30" > /etc/net/ifaces/R2/ipv4address
-----Заканчивание Базовых настроек Internet Admin Cli-----

    mkdir /etc/net/ifaces/R1-SW
    echo "TYPE=ovsbr " > /etc/net/ifaces/R1-SW/options
    systemctl enable --now openvswitch
    systemctl restart network
    modprobe 8021q
    echo "8021q" | tee -a /etc/modules
    systemctl restart network
    sed -i "s/OVS_REMOVE=yes/OVS_REMOVE=no/g" /etc/net/ifaces/default/options
    systemctl restart network
    ovs-vsctl add-prot R1-SW enp0s8 trunk=100,200
# 02.06.25 (Дополнение alt ver)

-----R2 tunel (R1 Alt Linux)-----

    mkdir /etc/net/ifaces/gre1
    vim /etc/net/ifaces/gre1/options
    TYPE=iptun
    TUNTYPE=gre
    TUNLOCAL=?10.10.10.1?
    TUNREMOTE=?10.10.10.2?
    TUNTTL=8
    HOST=??
    TUNOPTIONS='ttl 64'

    echo "10.10.10.1/30" > /etc/net/ifaces/gre1/ipv4address
    systemctl restart network
    modprobe gre
    echo "gre" | tee -a /etc/modules

        ^^ Провекрка ^^
    ip -c -br a
-----R1 tunel (R2 Alt Linux)-----

    mkdir /etc/net/ifaces/gre1
    vim /etc/net/ifaces/gre1/options
    TYPE=iptun
    TUNTYPE=gre
    TUNLOCAL=?10.10.10.2?
    TUNREMOTE=?10.10.10.1?
    TUNTTL=8
    HOST=??
    TUNOPTIONS='ttl 64'

    echo "10.10.10.2/30" > /etc/net/ifaces/gre1/ipv4address
    systemctl restart network
    modprobe gre
    echo "gre" | tee -a /etc/modules

        ^^ Провекрка ^^
    ip -c -br a
-----OSPFv2, NAT?, DHCP, ?DNS? (R1,2 if Alt Linux)-----

OSPFv2

    apt-get update && apt-get install -y frr
    vim /etc/frr/daemons
     ospfd=no > yes
    systemctl enable --now frr
    
        ^^ Провекрка ^^
    ss -tulpn | grep 'ospfd'

    vtysh
    R1#configure terminal 
    R1(config)#router ospf
    R1(config-router)#passive-interface default 
    R1(config-router)#network 10.10.10.0/30 area 0
    R1(config-router)#network 192.168.101.10/24 area 0
    R1(config-router)#network 192.168.101.11/24 area 0
    R1(config-router)#network 192.168.120.0/24 area 0
    R1(config-router)#exit
    R1(config)#interface gre1
    R1(config-if)#no ip ospf passive
    R1(config-if)#ip ospf authentication message-digest 
    R1(config-if)#ip ospf message-digest-key 1 md5 P@ssw0rd
    R1(config-if)#exit
    R1(config)#exit
    R1(config)#write memory
    Building configuration...

    R2
    /etc/net/sysctl.conf
     net.ipv4.ip_forward=0 > 1
    systemctl restart network
    apt-get update && apt-get install -y frr
    vim /etc/frr/daemons
     ospfd=no > yes
    systemctl enable --now frr
    
        ^^ Провекрка ^^
    ss -tulpn | grep 'ospfd'

    vtysh
    R2#configure terminal 
    R2(config)#router ospf 
    R2(config-router)#passive-interface default 
    R2(config-router)#network 10.10.10.0/30 area 0
    R2(config-router)#network 192.168.102.0/24 area 0
    R2(config-router)#network 192.168.110.0/24 area 0
    R2(config-router)#exit
    R2(config)#interface gre1
    R2(config-if)#no ip ospf passive
    R2(config-if)#ip ospf authentication message-digest 
    R2(config-if)#ip ospf message-digest-key 1 md5 P@ssw0rd
    R2(config-if)#exit
    R2(config)#exit
    R2(config)#write memory
    Building configuration...

        ^^ Провекрка ^^ (R1,R2)
    show ip ospf neighbor
    show ip route ospf
    ip -c -br -a

?NAT?

    R1
    iptables –t nat –A POSTROUTING –o enp?? –j MASQUERADE
    iptables-save >> /etc/sysconfig/iptables
    systemctl enable --now iptables
    
        ^^ Провекрка ^^ 
    iptables -t nat -L -n -v
    ip -c -br a

    R2
    iptables –t nat –A POSTROUTING –o enp?? –j MASQUERADE
    iptables-save >> /etc/sysconfig/iptables
    systemctl enable --now iptables
    
        ^^ Провекрка ^^ 
    iptables -t nat -L -n -v
    ip -c -br a

DHCP, ?DNS?

    R1
    apt-get install -y dhcp-server
    vim /etc/sysconfig/dhcpd
     DHCPDRAGS='vlan200, ???'
    cp /etc/dhcp/dhcpd.conf.example /etc/dhcp/dhcpd.conf
    vim /etc/dhcp/dhcpd.conf
    Пример:
    dhcpd. conf
    option domain-name
    "au-team.irpo";
    option domain-name-servers 192.168.101.254;
    default-lease-time 6000;
    max-lease-time 72000;
    authoritative;
    subnet 192.168.101.11 netmask 255.255.255.0 {
    range 192.168.101.13 192.168.100.253;
    option routers 192.168.101.12;}

![Ð¡Ð½Ð¸Ð¼Ð¾Ðº Ñ_ÐºÑ_Ð°Ð½Ð° Ð¾Ñ_ 2025-05-12 17-39-12](https://github.com/user-attachments/assets/c3aefa3c-efa4-4585-b72a-0c32fac9cd74)

    dhcpd -t -cf /etc/dhcp/dhcpd.conf
    systemctl enable --now dhcpd
    systemctl status dhcpd
    Пример проверки на Cli:
![Ð¡Ð½Ð¸Ð¼Ð¾Ðº Ñ_ÐºÑ_Ð°Ð½Ð° Ð¾Ñ_ 2025-05-12 17-55-08](https://github.com/user-attachments/assets/ad8e6b80-f136-4e9b-b757-e37c492e7a41)
![image (5)](https://github.com/user-attachments/assets/ee402446-0220-4507-b538-2fe5d7cecc8e)
![image (6)](https://github.com/user-attachments/assets/83a7ea0e-423b-475d-80a2-c438aba6360b)
![image (7)](https://github.com/user-attachments/assets/08877199-f1bf-49d9-8daf-fafe551a45e4)

# R2 (R2 if Alt Linux)
-----Имена-----

    hostnamectl set-hostname R1?.au-team.irpo?; exec bash
        ^^ Провекрка ^^
    hostname -f
-----R1-R2 (ИЛИ туннель в прудыдуших этапах)-----

    
    ip link
    apt-get update && apt-get install -y openvswitch
    ip -c a
    (50/50) 
    mkdir /etc/net/ifaces/ens?? (R1-R2)
    cat <<EOF > /etc/net/ifaces/ens?? (R1-R2)
      TYPE=eth
      DISABLED=no
      BOOTPROTO=static
    EOF
    echo "10.10.10.2/30" > /etc/net/ifaces/vlan100/ipv4address
-----Printer-----

    mkdir /etc/net/ifaces/ens?? (Printer)
    cat <<EOF > /etc/net/ifaces/ens?? (Printer)
      TYPE=eth
      DISABLED=no
      BOOTPROTO=static
    EOF
    echo "192.168.102.1/24" > /etc/net/ifaces/ens??/ipv4address
-----Cam2-----

    mkdir /etc/net/ifaces/ens?? (Cam2)
    cat <<EOF > /etc/net/ifaces/ens?? (Cam2)
      TYPE=eth
      DISABLED=no
      BOOTPROTO=static
    EOF
    echo "192.168.110.1/24" > /etc/net/ifaces/ens??/ipv4address
-----OSPFv2, NAT?, DHCP, ?DNS? (R1,2 if Alt Linux)-----

OSPFv2

        R2
    /etc/net/sysctl.conf
     net.ipv4.ip_forward=0 > 1
    systemctl restart network
    apt-get update && apt-get install -y frr
    vim /etc/frr/daemons
     ospfd=no > yes
    systemctl enable --now frr
    
        ^^ Провекрка ^^
    ss -tulpn | grep 'ospfd'

    vtysh
    R2#configure terminal 
    R2(config)#router ospf 
    R2(config-router)#passive-interface default 
    R2(config-router)#network 10.10.10.0/30 area 0
    R2(config-router)#network 192.168.102.0/24 area 0
    R2(config-router)#network 192.168.110.0/24 area 0
    R2(config-router)#exit
    R2(config)#interface gre1
    R2(config-if)#no ip ospf passive
    R2(config-if)#ip ospf authentication message-digest 
    R2(config-if)#ip ospf message-digest-key 1 md5 P@ssw0rd
    R2(config-if)#exit
    R2(config)#exit
    R2(config)#write memory
    Building configuration...

        ^^ Провекрка ^^ (R1,R2)
    show ip ospf neighbor
    show ip route ospf
    ip -c -br -a
?NAT?

    R2
    iptables –t nat –A POSTROUTING –o enp?? –j MASQUERADE
    iptables-save >> /etc/sysconfig/iptables
    systemctl enable --now iptables
    
        ^^ Провекрка ^^ 
    iptables -t nat -L -n -v
    ip -c -br a

-----ВЕЗДЕ-----

Время(ALT Linux)

    timedatectl set-timezone Europe/Moscow Регион/Страна (или панель упрваления)
    timedatectl

Пользователи(ALT Linux)

    R1,R2
    useradd net_admin
    usermod -aG wheel net_admin
    echo "net_admin ALL=(ALL:ALL) NOPASSWD: ALL" >> /etc/sudoers
    
    Admin,Cli#useradd sshuser –u 1010
    Admin,Cli#passwd sshuer
    Admin,Cli#usermod -aG wheel sshuser
    Admin,Cli#echo "sshuser ALL=(ALL:ALL) NOPASSWD: ALL" >> /etc/sudoers
    
    или
    
![изображение](https://github.com/user-attachments/assets/280b69ef-4174-4199-b974-21815aca3330)
![изображение](https://github.com/user-attachments/assets/97383198-7464-4637-a7ee-7076389a2d66)
![изображение](https://github.com/user-attachments/assets/99e6a841-d1a7-4b57-9da5-44c176210ced)

03.06.25 (very mini fix + check)
